import { parseMarkdown } from '../src/parser';
import { describe, it, expect } from 'vitest';

const testString = `
# | رسالة في التوبة PageV01P218
# فصل
# قال الإمام العلامة شيخ الإسلام تقي الدين أبو العباس أحمد بن عبدالحليم
~~ابن تيمية رحمه الله
# الحمد لله نحمده ونستعينه ونستهديه ونستغفره ونعوذ بالله من شرور أنفسنا
~~ومن سيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن
~~لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله أرسله بالهدى
~~ودين الحق ليظهره على الدين كله وكفى بالله شهيدا صلى الله عليه وعلى آله
~~وسلم تسليما
# قال الله تعالى @QB@ الر كتاب أحكمت آياته ثم فصلت من لدن حكيم خبير ألا
~~تعبدوا إلا الله إنني لكم منه نذير وبشير وأن استغفروا ربكم ثم توبوا إليه
~~يمتعكم متاعا حسنا إلى أجل مسمى ويؤت كل ذي فضل فضله وإن تولوا فإني أخاف
~~عليكم عذاب يوم كبير @QE@ سورة هود 1 3
# وقال تعالى @QB@ قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة
~~الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم وأنيبوا إلى ربكم
~~وأسلموا له من قبل أن يأتيكم العذاب ثم لا تنصرون واتبعوا أحسن ما أنزل
~~إليكم من ربكم من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون @QE@
~~PageV01P219 الآيات ( سورة الزمر 53 55 )
# وقال تعالى @QB@ يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا عسى ربكم
~~أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار يوم لا يخزي الله
~~النبي والذين آمنوا معه نورهم يسعى بين أيديهم وبأيمانهم @QE@ الآية ( سورة
~~التحريم 8 )
# وقال تعالى @QB@ وتوبوا إلى الله جميعا أيها المؤمنون لعلكم تفلحون @QE@
~~سورة النور 31
# وقال تعالى @QB@ لقد تاب الله على النبي والمهاجرين والأنصار الذين
~~اتبعوه في ساعة العسرة من بعد ما كاد يزيغ قلوب فريق منهم ثم تاب عليهم إنه
~~بهم رؤوف رحيم وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت
~~وضاقت عليهم أنفسهم وظنوا أن لا ملجأ من الله إلا إليه ثم تاب عليهم
~~ليتوبوا إن الله هو التواب الرحيم @QE@ سورة التوبة 117 118
# وقال تعالى @QB@ وقلنا يا آدم ms01 اسكن أنت وزوجك الجنة وكلا منها رغدا حيث
~~شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين فأزلهما الشيطان عنها
~~فأخرجهما مما كانا فيه وقلنا اهبطوا بعضكم لبعض عدو ولكم في الأرض مستقر
~~ومتاع إلى حين فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم @QE@
~~سورة البقرة 35 37 PageV01P220
`;

const expected = [
  {
    type: 'title',
    content: 'رسالة في التوبة',
  },
  {
    type: 'paragraph',
    content: 'فصل',
  },
  {
    type: 'paragraph',
    content:
      'قال الإمام العلامة شيخ الإسلام تقي الدين أبو العباس أحمد بن عبدالحليم ابن تيمية رحمه الله',
  },
  {
    type: 'paragraph',
    content:
      'الحمد لله نحمده ونستعينه ونستهديه ونستغفره ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله أرسله بالهدى ودين الحق ليظهره على الدين كله وكفى بالله شهيدا صلى الله عليه وعلى آله وسلم تسليما',
  },
  {
    type: 'paragraph',
    content: 'قال الله تعالى',
  },
  {
    type: 'blockquote',
    content:
      'الر كتاب أحكمت آياته ثم فصلت من لدن حكيم خبير ألا تعبدوا إلا الله إنني لكم منه نذير وبشير وأن استغفروا ربكم ثم توبوا إليه يمتعكم متاعا حسنا إلى أجل مسمى ويؤت كل ذي فضل فضله وإن تولوا فإني أخاف عليكم عذاب يوم كبير',
  },
  {
    type: 'paragraph',
    content: 'سورة هود 1 3',
  },
  {
    type: 'paragraph',
    content: 'وقال تعالى',
  },
  {
    type: 'blockquote',
    content:
      'قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم وأنيبوا إلى ربكم وأسلموا له من قبل أن يأتيكم العذاب ثم لا تنصرون واتبعوا أحسن ما أنزل إليكم من ربكم من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون',
  },
  {
    type: 'paragraph',
    content: 'الآيات ( سورة الزمر 53 55 )',
  },

  {
    type: 'paragraph',
    content: 'وقال تعالى',
  },
  {
    type: 'blockquote',
    content:
      'يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار يوم لا يخزي الله النبي والذين آمنوا معه نورهم يسعى بين أيديهم وبأيمانهم',
  },
  {
    type: 'paragraph',
    content: 'الآية ( سورة التحريم 8 )',
  },
  {
    type: 'paragraph',
    content: 'وقال تعالى',
  },
  {
    type: 'blockquote',
    content: 'وتوبوا إلى الله جميعا أيها المؤمنون لعلكم تفلحون',
  },
  {
    type: 'paragraph',
    content: 'سورة النور 31',
  },
  {
    type: 'paragraph',
    content: 'وقال تعالى',
  },
  {
    type: 'blockquote',
    content:
      'لقد تاب الله على النبي والمهاجرين والأنصار الذين اتبعوه في ساعة العسرة من بعد ما كاد يزيغ قلوب فريق منهم ثم تاب عليهم إنه بهم رؤوف رحيم وعلى الثلاثة الذين خلفوا حتى إذا ضاقت عليهم الأرض بما رحبت وضاقت عليهم أنفسهم وظنوا أن لا ملجأ من الله إلا إليه ثم تاب عليهم ليتوبوا إن الله هو التواب الرحيم',
  },
  {
    type: 'paragraph',
    content: 'سورة التوبة 117 118',
  },
  {
    type: 'paragraph',
    content: 'وقال تعالى',
  },
  {
    type: 'blockquote',
    content:
      'وقلنا يا آدم اسكن أنت وزوجك الجنة وكلا منها رغدا حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين فأزلهما الشيطان عنها فأخرجهما مما كانا فيه وقلنا اهبطوا بعضكم لبعض عدو ولكم في الأرض مستقر ومتاع إلى حين فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم',
  },
  {
    type: 'paragraph',
    content: 'سورة البقرة 35 37',
  },
];

describe('parseMarkdown', () => {
  it('should return block in expected format', () => {
    const result = parseMarkdown(testString);
    expect(result.content.flatMap((item) => item.blocks)).toEqual(expected);
  });
});
