import { Block } from '../types';

/**
 * This function splits the paragraph string by block quotes,
 * and returns an array of blocks, where each block is either
 * a paragraph or a block quote.
 *
 * @param {string} paragraph
 * @returns {Block[]}
 */
let logs = 0;
export function splitParagraphByBlockQuotes(paragraph: string): Block[] {
  // This regex matches the content within block quotes,
  // capturing the content regardless of whether it starts with @QB@ or @QE@.
  // It captures the content of block quotes without including the markers.
  const regex = /@QB@(.*?)@QE@/gs;

  // Split the input string while keeping the content of block quotes.
  // We use 'split' to get the parts outside the block quotes,
  // and the capturing group in the regex to keep the block quotes content.
  const parts = paragraph.split(regex);

  // Initialize an array to hold the processed segments.
  const segments: Block[] = [];

  // Keep track of the current index in the original split result,
  // because we need to alternate between adding non-block-quote content
  // and block-quote content to the segments array.
  for (let i = 0; i < parts.length; i++) {
    const part = parts[i]?.replace(/@QB@|@QE@/g, '')?.trim();
    const isBlockQuote = i > 0 && i % 2 === 1; // if the index is odd, it's a blockquote

    if (!part || part === '') {
      continue;
    }

    // If the part is not empty, add it to the segments array.
    // This step also effectively filters out any empty strings
    // that might result from leading or trailing block quote markers,
    // or from two consecutive block quote markers.

    const lastSegment = segments[segments.length - 1];
    // if the segment before is a blockquote, then skip it
    if (lastSegment && lastSegment.content === part) {
      continue;
    }

    segments.push({
      type: isBlockQuote ? 'blockquote' : 'paragraph',
      content: part,
    });
  }

  if (segments.length > 1 && logs < 2) {
    console.log({ segments, parts });
    logs++;
  }

  return segments;
}

// {
//   segments: [
//     {
//       type: 'paragraph',
//       content: '3 حدثنا يحيى بن بكير قال حدثنا الليث عن عقيل عن بن شهاب عن عروة بن الزبير عن عائشة أم المؤمنين أنها قالت * أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحي الرؤيا الصالحة في النوم فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح ثم حبب إليه الخلاء وكان يخلو بغار حراء فيتحنث فيه وهو التعبد الليالي ذوات العدد قبل أن ينزع إلى أهله ويتزود لذلك ثم يرجع إلى خديجة فيتزود لمثلها حتى جاءه الحق وهو في غار حراء فجاءه الملك فقال اقرأ قال ما أنا بقارئ قال فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني فقال اقرأ قلت ما أنا بقارئ فأخذني فغطني الثانية حتى بلغ مني الجهد ثم أرسلني فقال اقرأ فقلت ما أنا بقارئ فأخذني فغطني الثالثة ثم أرسلني فقال'
//     },
//     {
//       type: 'blockquote',
//       content: 'اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم'
//     },
//     {
//       type: 'paragraph',
//       content: 'اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم'
//     },
//     {
//       type: 'paragraph',
//       content: 'فرجع بها رسول الله صلى الله عليه وسلم يرجف فؤاده فدخل على خديجة بنت خويلد رضي الله عنها فقال زملوني زملوني فزملوه حتى ذهب عنه الروع فقال لخديجة وأخبرها الخبر لقد خشيت على نفسي فقالت خديجة كلا والله ما يخزيك الله أبدا إنك لتصل الرحم وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين على نوائب الحق فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى بن عم خديجة وكان امرأ تنصر في الجاهلية وكان يكتب الكتاب العبراني فيكتب من الإنجيل بالعبرانية ما شاء الله أن يكتب وكان شيخا كبيرا قد عمي فقالت له خديجة يا بن عم اسمع من بن أخيك فقال له ورقة يا بن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رأى فقال له ورقة هذا الناموس الذي نزل الله على موسى يا ليتني فيها جذع ليتني أكون حيا إذ يخرجك قومك فقال رسول الله صلى الله عليه وسلم أو مخرجي هم قال نعم لم يأت رجل قط بمثل ما جئت به إلا عودي وإن يدركني يومك أنصرك نصرا مؤزرا ثم لم ينشب ورقة أن توفي وفتر الوحي'
//     }
//   ],
//   parts: [
//     '3 حدثنا يحيى بن بكير قال حدثنا الليث عن عقيل عن بن شهاب عن عروة بن الزبير عن عائشة أم المؤمنين أنها قالت * أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحي الرؤيا الصالحة في النوم فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح ثم حبب إليه الخلاء وكان يخلو بغار حراء فيتحنث فيه وهو التعبد الليالي ذوات العدد قبل أن ينزع إلى أهله ويتزود لذلك ثم يرجع إلى خديجة فيتزود لمثلها حتى جاءه الحق وهو في غار حراء فجاءه الملك فقال اقرأ قال ما أنا بقارئ قال فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني فقال اقرأ قلت ما أنا بقارئ فأخذني فغطني الثانية حتى بلغ مني الجهد ثم أرسلني فقال اقرأ فقلت ما أنا بقارئ فأخذني فغطني الثالثة ثم أرسلني فقال ',
//     '@QB@ اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم @QE@',
//     ' اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم ',
//     undefined,
//     undefined,
//     ' فرجع بها رسول الله صلى الله عليه وسلم يرجف فؤاده فدخل على خديجة بنت خويلد رضي الله عنها فقال زملوني زملوني فزملوه حتى ذهب عنه الروع فقال لخديجة وأخبرها الخبر لقد خشيت على نفسي فقالت خديجة كلا والله ما يخزيك الله أبدا إنك لتصل الرحم وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين على نوائب الحق فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى بن عم خديجة وكان امرأ تنصر في الجاهلية وكان يكتب الكتاب العبراني فيكتب من الإنجيل بالعبرانية ما شاء الله أن يكتب وكان شيخا كبيرا قد عمي فقالت له خديجة يا بن عم اسمع من بن أخيك فقال له ورقة يا بن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رأى فقال له ورقة هذا الناموس الذي نزل الله على موسى يا ليتني فيها جذع ليتني أكون حيا إذ يخرجك قومك فقال رسول الله صلى الله عليه وسلم أو مخرجي هم قال نعم لم يأت رجل قط بمثل ما جئت به إلا عودي وإن يدركني يومك أنصرك نصرا مؤزرا ثم لم ينشب ورقة أن توفي وفتر الوحي  '
//   ]
// }
// {
//   segments: [
//     {
//       type: 'paragraph',
//       content: '4 قال بن شهاب وأخبرني أبو سلمة بن عبد الرحمن أن جابر بن عبد الله الأنصاري قال وهو يحدث عن فترة الوحي فقال في حديثه * بينا أنا أمشي إذ سمعت صوتا من السماء فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض فرعبت منه فرجعت فقلت زملوني زملوني فأنزل الله تعالى'
//     },
//     { type: 'blockquote', content: 'يا أيها المدثر قم فأنذر' },
//     { type: 'paragraph', content: 'يا أيها المدثر قم فأنذر' },
//     { type: 'paragraph', content: 'إلى قوله' },
//     { type: 'paragraph', content: 'والرجز فاهجر' },
//     { type: 'paragraph', content: 'والرجز فاهجر' },
//     {
//       type: 'paragraph',
//       content: 'فحمي الوحي وتتابع تابعه عبد الله بن يوسف وأبو صالح وتابعه هلال بن رداد عن الزهري وقال يونس ومعمر بوادره'
//     }
//   ],
//   parts: [
//     '4 قال بن شهاب وأخبرني أبو سلمة بن عبد الرحمن أن جابر بن عبد الله الأنصاري قال وهو يحدث عن فترة الوحي فقال في حديثه * بينا أنا أمشي إذ سمعت صوتا من السماء فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض فرعبت منه فرجعت فقلت زملوني زملوني فأنزل الله تعالى ',
//     '@QB@ يا أيها المدثر قم فأنذر @QE@',
//     ' يا أيها المدثر قم فأنذر ',
//     undefined,
//     undefined,
//     ' إلى قوله ',
//     '@QB@ والرجز فاهجر @QE@',
//     ' والرجز فاهجر ',
//     undefined,
//     undefined,
//     ' فحمي الوحي وتتابع تابعه عبد الله بن يوسف وأبو صالح وتابعه هلال بن رداد عن الزهري وقال يونس ومعمر بوادره '
//   ]
// }

// {
//   segments: [
//     {
//       type: 'paragraph',
//       content: '3 حدثنا يحيى بن بكير قال حدثنا الليث عن عقيل عن بن شهاب عن عروة بن الزبير عن عائشة أم المؤمنين أنها قالت * أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحي الرؤيا الصالحة في النوم فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح ثم حبب إليه الخلاء وكان يخلو بغار حراء فيتحنث فيه وهو التعبد الليالي ذوات العدد قبل أن ينزع إلى أهله ويتزود لذلك ثم يرجع إلى خديجة فيتزود لمثلها حتى جاءه الحق وهو في غار حراء فجاءه الملك فقال اقرأ قال ما أنا بقارئ قال فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني فقال اقرأ قلت ما أنا بقارئ فأخذني فغطني الثانية حتى بلغ مني الجهد ثم أرسلني فقال اقرأ فقلت ما أنا بقارئ فأخذني فغطني الثالثة ثم أرسلني فقال'
//     },
//     {
//       type: 'blockquote',
//       content: 'اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم'
//     },
//     {
//       type: 'paragraph',
//       content: 'فرجع بها رسول الله صلى الله عليه وسلم يرجف فؤاده فدخل على خديجة بنت خويلد رضي الله عنها فقال زملوني زملوني فزملوه حتى ذهب عنه الروع فقال لخديجة وأخبرها الخبر لقد خشيت على نفسي فقالت خديجة كلا والله ما يخزيك الله أبدا إنك لتصل الرحم وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين على نوائب الحق فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى بن عم خديجة وكان امرأ تنصر في الجاهلية وكان يكتب الكتاب العبراني فيكتب من الإنجيل بالعبرانية ما شاء الله أن يكتب وكان شيخا كبيرا قد عمي فقالت له خديجة يا بن عم اسمع من بن أخيك فقال له ورقة يا بن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رأى فقال له ورقة هذا الناموس الذي نزل الله على موسى يا ليتني فيها جذع ليتني أكون حيا إذ يخرجك قومك فقال رسول الله صلى الله عليه وسلم أو مخرجي هم قال نعم لم يأت رجل قط بمثل ما جئت به إلا عودي وإن يدركني يومك أنصرك نصرا مؤزرا ثم لم ينشب ورقة أن توفي وفتر الوحي'
//     }
//   ],
//   parts: [
//     '3 حدثنا يحيى بن بكير قال حدثنا الليث عن عقيل عن بن شهاب عن عروة بن الزبير عن عائشة أم المؤمنين أنها قالت * أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحي الرؤيا الصالحة في النوم فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح ثم حبب إليه الخلاء وكان يخلو بغار حراء فيتحنث فيه وهو التعبد الليالي ذوات العدد قبل أن ينزع إلى أهله ويتزود لذلك ثم يرجع إلى خديجة فيتزود لمثلها حتى جاءه الحق وهو في غار حراء فجاءه الملك فقال اقرأ قال ما أنا بقارئ قال فأخذني فغطني حتى بلغ مني الجهد ثم أرسلني فقال اقرأ قلت ما أنا بقارئ فأخذني فغطني الثانية حتى بلغ مني الجهد ثم أرسلني فقال اقرأ فقلت ما أنا بقارئ فأخذني فغطني الثالثة ثم أرسلني فقال ',
//     ' اقرأ باسم ربك الذي خلق خلق الإنسان من علق اقرأ وربك الأكرم ',
//     ' فرجع بها رسول الله صلى الله عليه وسلم يرجف فؤاده فدخل على خديجة بنت خويلد رضي الله عنها فقال زملوني زملوني فزملوه حتى ذهب عنه الروع فقال لخديجة وأخبرها الخبر لقد خشيت على نفسي فقالت خديجة كلا والله ما يخزيك الله أبدا إنك لتصل الرحم وتحمل الكل وتكسب المعدوم وتقري الضيف وتعين على نوائب الحق فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى بن عم خديجة وكان امرأ تنصر في الجاهلية وكان يكتب الكتاب العبراني فيكتب من الإنجيل بالعبرانية ما شاء الله أن يكتب وكان شيخا كبيرا قد عمي فقالت له خديجة يا بن عم اسمع من بن أخيك فقال له ورقة يا بن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رأى فقال له ورقة هذا الناموس الذي نزل الله على موسى يا ليتني فيها جذع ليتني أكون حيا إذ يخرجك قومك فقال رسول الله صلى الله عليه وسلم أو مخرجي هم قال نعم لم يأت رجل قط بمثل ما جئت به إلا عودي وإن يدركني يومك أنصرك نصرا مؤزرا ثم لم ينشب ورقة أن توفي وفتر الوحي  '
//   ]
// }
// {
//   segments: [
//     {
//       type: 'paragraph',
//       content: '4 قال بن شهاب وأخبرني أبو سلمة بن عبد الرحمن أن جابر بن عبد الله الأنصاري قال وهو يحدث عن فترة الوحي فقال في حديثه * بينا أنا أمشي إذ سمعت صوتا من السماء فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض فرعبت منه فرجعت فقلت زملوني زملوني فأنزل الله تعالى'
//     },
//     { type: 'blockquote', content: 'يا أيها المدثر قم فأنذر' },
//     { type: 'paragraph', content: 'إلى قوله' },
//     { type: 'paragraph', content: 'والرجز فاهجر' },
//     {
//       type: 'paragraph',
//       content: 'فحمي الوحي وتتابع تابعه عبد الله بن يوسف وأبو صالح وتابعه هلال بن رداد عن الزهري وقال يونس ومعمر بوادره'
//     }
//   ],
//   parts: [
//     '4 قال بن شهاب وأخبرني أبو سلمة بن عبد الرحمن أن جابر بن عبد الله الأنصاري قال وهو يحدث عن فترة الوحي فقال في حديثه * بينا أنا أمشي إذ سمعت صوتا من السماء فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض فرعبت منه فرجعت فقلت زملوني زملوني فأنزل الله تعالى ',
//     ' يا أيها المدثر قم فأنذر ',
//     ' إلى قوله ',
//     ' والرجز فاهجر ',
//     ' فحمي الوحي وتتابع تابعه عبد الله بن يوسف وأبو صالح وتابعه هلال بن رداد عن الزهري وقال يونس ومعمر بوادره '
//   ]
// }
